Revit 2025 API
BreakPatternCondition Enumeration
 Condition on which patterns distribution will be broken.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum BreakPatternCondition
Public Enumeration BreakPatternCondition
public enum class BreakPatternCondition
type BreakPatternCondition
Members
Member name | Value | Description
EachSegmentEnd | 0 |  Patterns distribution is broken at each segment end.
AnglesGreaterThan | 1 |  Patterns distribution is broken if the angle between neighboring path segments is greater than the defined.
Never | 2 |  Patterns are distributed along whole path of a railing.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace